Autodesk.Revit.DB.ReferenceUtils.UpdateGeomTagsFromReferences(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IDictionary{System.Int32,System.Int32},System.Collections.Generic.IDictionary{System.Int32,System.Int32})
Iterate through the references of the input object and if we have any pointing at the beam with the provided Id
replace those with the old values from faceIdxMap with the new ones
doc:
Revit document.
inputElemId:
the Id of the object for which to update the references
referencedElemId:
elemId to check the reference is pointing to the desired object
facesIdxMap:
map of old face index to new face index
edgesIdxMap:
map of old face index to new face index
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027